hiro22022/ASP3_STM32H747_DISCO/target/stm32h747_discovery_m7/stm32hcube/CM4/Core/Src/main.c
/* Joystick 構成構造体 */
typedef struct {
    GPIO_TypeDef  *gpio;
    uint32_t      Pin;
} Joy_conf;

/* JOY_SEL～JOY_UP の構成 */
const Joy_conf joy_conf[] =
{
    { GPIOK, GPIO_PIN_2 },      /* JOY_SEL */
    { GPIOK, GPIO_PIN_3 },      /* JOY_DOWN */
    { GPIOK, GPIO_PIN_4 },      /* JOY_LEFT */
    { GPIOK, GPIO_PIN_5 },      /* JOY_RIGHT */
    { GPIOK, GPIO_PIN_6 },      /* JOY_UP */
};

#ifdef NEED_JOYSTICK_INIT    /* CM7 側で初期化は済んでいる */

/* joystick の初期化 */
void joy_init(void)
{
    uint32_t temp;
    int  i;

    /* RCC (クロック) の設定 */
    RCC_TypeDef  *rcc = RCC;
    temp = rcc->AHB4ENR;
    temp |= RCC_AHB4ENR_GPIOKEN;    /* GPIO PK2..5 に接続される */
    rcc->AHB4ENR = temp;

    /* GPIO コントロールレジスタの設定 */
    GPIO_InitTypeDef gpio_init;
    gpio_init.Mode      = GPIO_MODE_INPUT;
    gpio_init.Pull      = GPIO_PULLUP;        /* SWを押すと GND になる */
    gpio_init.Speed     = GPIO_SPEED_FREQ_LOW;
    gpio_init.Alternate = 0x0;
    for( i = JOY_SEL; i <= JOY_UP; i++ ){
        gpio_init.Pin   = joy_conf[ i ].Pin;
        HAL_GPIO_Init( joy_conf[ i ].gpio, &gpio_init );
    }
}
#endif /* NEED_JOYSTICK_INIT */

int joy_stat(void)
{
    int  val = 0;
    int  i;

    /* 5回繰り返し読むので効率悪い。製品ではお勧めしないコーディング */
    for( i = JOY_SEL; i <= JOY_UP; i++ ){
      val |= ((int)HAL_GPIO_ReadPin( joy_conf[ i ].gpio, joy_conf[ i ].Pin ) ? 0:1) << i;
    }
    return val;
}

/*--------------------------- Button --------------------------*/
/* Joystick 構成構造体 */
typedef struct {
    GPIO_TypeDef  *gpio;
    uint32_t      Pin;
} Btn_conf;

/* Button の構成 */
const Btn_conf btn_conf[] =
{
    { GPIOC, GPIO_PIN_13 },      /* Button */
};

#ifdef NEED_BTNK_INIT    /* CM7 側で初期化は済んでいる */

/* Button の初期化 */
void btn_init(void)
{
    uint32_t temp;
    int  i;

    /* RCC (クロック) の設定 */
    RCC_TypeDef  *rcc = RCC;
    temp = rcc->AHB4ENR;
    temp |= RCC_AHB4ENR_GPIOCEN;    /* GPIO PK2..5 に接続される */
    rcc->AHB4ENR = temp;

    /* GPIO コントロールレジスタの設定 */
    GPIO_InitTypeDef gpio_init;
    gpio_init.Mode      = GPIO_MODE_INPUT;
    gpio_init.Pull      = GPIO_NOPULL;        /* 外部で Pull Down されている */
    gpio_init.Speed     = GPIO_SPEED_FREQ_LOW;
    gpio_init.Alternate = 0x0;
    for( i = 0; i < 1; i++ ){
        gpio_init.Pin   = btn_conf[ i ].Pin;
        HAL_GPIO_Init( btn_conf[ i ].gpio, &gpio_init );
    }
}
#endif /* NEED_BTN_INIT  */

int btn_stat(void)
{
    int  val = 0;
    int  i;

    /* 5回繰り返し読むので効率悪い。製品ではお勧めしないコーディング */
    for( i = 0; i < 1; i++ ){
      val |= ((int)HAL_GPIO_ReadPin( btn_conf[ i ].gpio, btn_conf[ i ].Pin ) ? 1:0) << i;
    }
    return val;
}

/* 0⇒1 になると戻る */
void btn_pos_edge()
{
  while(btn_stat())         /* 0 になるのを待つ */
  {}
  while(btn_stat()==0)      /* 1 になるのを待つ */
  {}
}

/* 1⇒0 になると戻る */
void btn_neg_edge()
{
  while(btn_stat()==0)      /* 1 になるのを待つ */
  {}
  while(btn_stat())         /* 0 になるのを待つ */
  {}
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  COM_INIT();
  COM_FREE_COUNT = 0;
  /* USER CODE END 1 */

/* USER CODE BEGIN Boot_Mode_Sequence_1 */
  /*HW semaphore Clock enable*/
  __HAL_RCC_HSEM_CLK_ENABLE();
  /* Activate HSEM notification for Cortex-M4*/
  HAL_HSEM_ActivateNotification(__HAL_HSEM_SEMID_TO_MASK(HSEM_ID_0));
  /*
  Domain D2 goes to STOP mode (Cortex-M4 in deep-sleep) waiting for Cortex-M7 to
  perform system initialization (system clock config, external memory configuration.. )
  */
  HAL_PWREx_ClearPendingEvent();
  HAL_PWREx_EnterSTOPMode(PWR_MAINREGULATOR_ON, PWR_STOPENTRY_WFE, PWR_D2_DOMAIN);
  /* Clear HSEM flag */
  __HAL_HSEM_CLEAR_FLAG(__HAL_HSEM_SEMID_TO_MASK(HSEM_ID_0));
  COM_FREE_COUNT = 1;

/* USER CODE END Boot_Mode_Sequence_1 */
  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();
  COM_FREE_COUNT = 2;

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */
#if 0
  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();
  MX_ADC3_Init();
  MX_ETH_Init();
  MX_FMC_Init();
  MX_HDMI_CEC_Init();
  MX_QUADSPI_Init();
  MX_RTC_Init();
  MX_SAI1_Init();
  MX_SDMMC1_SD_Init();
  MX_SPDIFRX1_Init();
  MX_SPI2_Init();
  MX_SPI5_Init();
#endif
  MX_TIM8_Init();
  MX_TIM13_Init();
#if 0
  MX_UART8_Init();
  MX_USB_OTG_HS_PCD_Init();
#endif // 0
  /* USER CODE BEGIN 2 */
#define MSG_CM4 "hello CM4!\r\n"
  HAL_UART_Transmit(&huart8, (uint8_t*)MSG_CM4, sizeof(MSG_CM4), 0xfffffff);
  COM_FREE_COUNT = 3;
#ifdef INIT_TIM_IN_MAIN
  HAL_TIM_Base_Start_IT(&htim8);
  HAL_TIM_Base_Start(&htim13);
#endif
  COM_FREE_COUNT = 4;
  /* USER CODE END 2 */

//  NVIC_EnableIRQ(TIM8_UP_TIM13_IRQn);
//  __enable_fault_irq();   // start.S で cpsid f で禁止されてくる


  COM_PUSH_HSEM = 0;
#define SET_FREE_COUNT( count, val )  COM_FREE_COUNT = ((count << 16) | (val & 0xffff))
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  int  j = 0;
    (void)j;
  while (1)
  {
    static int  count = 0;
    static int  val, val2;
    /* USER CODE END WHILE */
    COM_TIM1_COUNT = __HAL_TIM_GET_COUNTER(&htim8);

    count++;
    if( count % 100000 == 0 ){
#if 1
      led_set( count / 100000 );
      if(j++ == (16*1))
        break;
#endif
    }

    if( COM_PUSH_HSEM > 0 ){
      COM_PUSH_HSEM = 0;
      (void)HAL_HSEM_FastTake( 0 );
      val2 = 0x10;
    }
    else if( COM_PUSH_HSEM < 0 ){
      COM_PUSH_HSEM = 0;
      HAL_HSEM_Release( 0, 0 );    /* リリースしたときに HSEM 割込みが Core 1 に入る */
      val2 = 0x20;
    }

    val = HAL_HSEM_IsSemTaken( 0 ) | val2;
    SET_FREE_COUNT( count, val );
    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
  btn_neg_edge();       /******** ボタン待ち **********/
  sta_ker();
}

